//=============================================================================
//
// ファイル処理 [file.h]
// Author : GP11A132 25 松本　賢治
//
//=============================================================================
#pragma once

#include "main.h"
#include "player.h"
#include "enemy.h"
#include "score.h"
#include "highscore.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/



/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct	SAVEDATA				// セーブデータの構造体
{
	// プレイヤーデータを保存
	PLAYER	player[MAX_PLAYER];	// プレイヤーのMAX人数分セーブする

	// エネミーデータを保存
	ENEMY	enemy[MAX_ENEMY];	// エネミーのMAX人数分セーブする

	// スコアデータを保存
	int		score;				// スコアを保存する

	// ハイスコアデータを保存
	int		highscore;				// スコアを保存する
	// 他にも何かセーブしたい物があればここに追加

	int		sum;				// チェックサムを入れる
};



/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void SaveData(void);
void LoadData(void);


