//=============================================================================
//
// ハイスコア処理 [highscore.h]
// Author : GP11A132 25 松本　賢治
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define HIGHSCORE_MAX			(99999)		// ハイスコアの最大値
#define HIGHSCORE_DIGIT			(5)			// 桁数




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHighscore(void);
void UninitHighscore(void);
void UpdateHighscore(void);
void DrawHighscore(void);

void AddHighscore(int add);
int GetHighscore(void);
void SetHighscore(int highscore);

